{
  "component-definition": {
    "uuid": "6a7772a4-761a-4989-9671-87652004a924",
    "metadata": {
      "title": "Component for Baustein INF.13: Technisches Gebäudemanagement",
      "last-modified": "2025-06-26T11:47:52.731502+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.2",
      "remarks": "AI-enriched component for INF.13."
    },
    "components": [
      {
        "uuid": "4c77f5a1-089c-4579-90b1-ac2bf12e791e",
        "type": "service",
        "title": "Technisches Gebäudemanagement",
        "description": "Implementation of controls for Baustein INF.13.",
        "control-implementations": [
          {
            "uuid": "03dda581-03ea-4d24-9cd9-fec34d7b0318",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "Implementation for all controls in group INF.13: Technisches Gebäudemanagement",
            "implemented-requirements": [
              {
                "uuid": "e0717f14-cec2-4f06-98d7-30d019c3e155",
                "control-id": "INF.13.A1",
                "description": "Base implementation for control INF.13.A1."
              },
              {
                "uuid": "a5c28475-596e-400a-b153-60ab1af12008",
                "control-id": "INF.13.A2",
                "description": "Base implementation for control INF.13.A2."
              },
              {
                "uuid": "e79821d2-61cd-4a70-b180-31007a1fd709",
                "control-id": "INF.13.A3",
                "description": "Base implementation for control INF.13.A3."
              },
              {
                "uuid": "0906ce32-449d-4095-ab46-30edaeedbfde",
                "control-id": "INF.13.A4",
                "description": "Base implementation for control INF.13.A4."
              },
              {
                "uuid": "5cc2c4b6-6c1c-42c4-acbf-05b75ef0398a",
                "control-id": "INF.13.A5",
                "description": "Base implementation for control INF.13.A5."
              },
              {
                "uuid": "b223bec0-1b82-498d-a769-43e924906a65",
                "control-id": "INF.13.A6",
                "description": "Base implementation for control INF.13.A6."
              },
              {
                "uuid": "ee103e8e-d433-46a3-9631-a885739df191",
                "control-id": "INF.13.A7",
                "description": "Base implementation for control INF.13.A7."
              },
              {
                "uuid": "251b3d75-d2e4-43cb-b8b1-c019beab3eb1",
                "control-id": "INF.13.A8",
                "description": "Base implementation for control INF.13.A8."
              },
              {
                "uuid": "c5198727-fe1f-4887-9aa0-edccd44d1fce",
                "control-id": "INF.13.A9",
                "description": "Base implementation for control INF.13.A9."
              },
              {
                "uuid": "e1f06fb3-cf66-4bc4-b5da-3e36fae622e0",
                "control-id": "INF.13.A10",
                "description": "Base implementation for control INF.13.A10."
              }
            ]
          },
          {
            "uuid": "f48423a9-280a-4176-8699-48c686b04c48",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "Abhängigkeiten von verwandten Bausteinen",
            "implemented-requirements": [
              {
                "uuid": "9bc41cea-bad9-4675-b7fc-a4fcdc1da008",
                "control-id": "IND.3.2.A1",
                "description": "AI-Begründung: Da TGM-Systeme oft OT-Charakter haben und Fernwartung üblich ist, ist ein zentrales Konzept unerlässlich, um die Sicherheit und Kontrolle über Zugriffe zu gewährleisten."
              },
              {
                "uuid": "2a9fd3f2-4ee0-4f0f-83cd-b4d10069ea72",
                "control-id": "IND.3.2.A2",
                "description": "AI-Begründung: TGM-Systeme haben oft Schnittstellen zur Büro-IT. Eine gemeinsame, konsistente Dokumentation aller Fernwartungszugänge ist entscheidend, um Sicherheitslücken an den Schnittstellen zu vermeiden."
              },
              {
                "uuid": "59f64c7c-ed7d-4d9a-b58e-51451ff41b71",
                "control-id": "IND.3.2.A3",
                "description": "AI-Begründung: Regelmäßige Prüfungen und ein Genehmigungsprozess für Abweichungen stellen sicher, dass das Fernwartungskonzept für das TGM wirksam bleibt und nicht umgangen wird."
              },
              {
                "uuid": "452b741d-4f23-4aa8-aba3-191b0637ec98",
                "control-id": "IND.3.2.A4",
                "description": "AI-Begründung: Die Wartung von TGM-Anlagen wird häufig von externen Dienstleistern durchgeführt. Vertragliche Regelungen sind daher zwingend erforderlich, um deren Zugriffe abzusichern und die Verantwortung zu klären."
              },
              {
                "uuid": "df1706c8-fe6a-4625-be1a-06f994257ff1",
                "control-id": "IND.3.2.A5",
                "description": "AI-Begründung: Eine klare interne Abstimmung über Prozesse und Zuständigkeiten für die Fernwartung von TGM-Systemen ist notwendig, um Kompetenzkonflikte und Sicherheitslücken zwischen TGM-Betrieb und IT zu vermeiden."
              },
              {
                "uuid": "1b1381bf-cc8b-42e8-b6c9-6b756a048606",
                "control-id": "IND.3.2.A6",
                "description": "AI-Begründung: Diese Anforderung stellt sicher, dass der Betreiber des TGM die Hoheit über die Zugriffe auf seine kritischen Systeme behält und nicht allein von externen Sicherheitskomponenten abhängig ist."
              },
              {
                "uuid": "1272bd52-4459-4675-83b7-27f929b51613",
                "control-id": "IND.3.2.A7",
                "description": "AI-Begründung: Die technische Entkopplung mittels Sprungserver ist eine bewährte Methode, um Fernzugriffe auf sensible TGM-Netze abzusichern und die Angriffsfläche erheblich zu reduzieren."
              },
              {
                "uuid": "0697a409-1f49-4d11-a93c-11f92f6250b4",
                "control-id": "IND.3.2.A8",
                "description": "AI-Begründung: Eine explizite Freigabe jeder Sitzung verhindert unbemerkte oder ungeplante Zugriffe, die den Betrieb von gebäudetechnischen Anlagen stören oder gefährden könnten."
              },
              {
                "uuid": "9752c89b-af78-4269-934a-f393174294d0",
                "control-id": "IND.3.2.A9",
                "description": "AI-Begründung: Der Dateiaustausch ist ein häufiger Angriffsvektor. Ein sicherer Prozess hierfür ist im TGM-Umfeld essenziell, um die Einschleusung von Schadsoftware zu verhindern."
              },
              {
                "uuid": "d2dfc543-bed8-4e76-a391-a363787c5a59",
                "control-id": "IND.3.2.A10",
                "description": "AI-Begründung: Da Fernwartung im TGM physische Systeme steuert, ist die Beobachtung und die Möglichkeit zum Eingreifen entscheidend, um Gefährdungen für Personen und Anlagen (Safety-Aspekte) auszuschließen."
              },
              {
                "uuid": "300777c5-6c90-44f3-8f77-9be0455f48c4",
                "control-id": "IND.3.2.A11",
                "description": "AI-Begründung: Die zentrale Verwaltung von Fernwartungskonten für TGM-Systeme ist eine grundlegende Anforderung für ein effektives Identitäts- und Berechtigungsmanagement und verhindert die unkontrollierte Verbreitung von Zugängen."
              },
              {
                "uuid": "5bab9ea5-be49-4219-8079-cd713b4cd811",
                "control-id": "IND.3.2.A12",
                "description": "AI-Begründung: Für TGM in Umgebungen mit hohem Schutzbedarf bietet eine dedizierte, von der Büro-IT getrennte Fernwartungslösung eine stärkere Isolation und damit ein höheres Sicherheitsniveau."
              },
              {
                "uuid": "dea406ff-f9c3-40cd-bc37-df55abda6a59",
                "control-id": "IND.3.2.A13",
                "description": "AI-Begründung: In hochkritischen TGM-Umgebungen ermöglicht die Protokollierung von Sitzungsinhalten eine lückenlose Nachvollziehbarkeit und forensische Analyse bei Sicherheitsvorfällen."
              },
              {
                "uuid": "88d789da-4f1c-4dae-8037-ac213d72eca8",
                "control-id": "IND.3.2.A14",
                "description": "AI-Begründung: Die technische Kontrolle von Sitzungen auf Befehlsebene bietet einen proaktiven Schutz vor schädlichen oder fehlerhaften Aktionen während der Fernwartung kritischer TGM-Systeme."
              },
              {
                "uuid": "9be8a74a-70fe-4af9-93cb-06a25c536649",
                "control-id": "OPS.1.2.5.A1",
                "description": "AI-Begründung: Diese Anforderung stellt die grundlegende und geordnete Planung von Fernwartungszugängen im TGM sicher und ist eine Basis für alle weiteren spezifischen Maßnahmen."
              },
              {
                "uuid": "9a11ea55-b6a3-4af3-9b1a-8ef2e20ed9b5",
                "control-id": "OPS.1.2.5.A2",
                "description": "AI-Begründung: Diese Anforderung ist relevant für Bedien- und Engineering-Clients im TGM-Umfeld, um die Zustimmung des Anwenders vor einem Fernzugriff sicherzustellen und so die Kontrolle zu wahren."
              },
              {
                "uuid": "ef93b004-ce6d-46cd-94f9-ec01c9374685",
                "control-id": "OPS.1.2.5.A3",
                "description": "AI-Begründung: Die Absicherung der Schnittstellen durch Beschränkung, Verschlüsselung und bedarfsgerechte Installation ist eine grundlegende Sicherheitsmaßnahme, die für alle Fernwartungszugänge im TGM gilt."
              },
              {
                "uuid": "c773ba48-dd77-44e8-9e45-aace8ea2ddf4",
                "control-id": "OPS.1.2.5.A5",
                "description": "AI-Begründung: Dienstleister im TGM-Bereich nutzen oft cloudbasierte Fernwartungsdienste. Deren Einsatz muss geregelt werden, um die damit verbundenen Risiken zu kontrollieren."
              },
              {
                "uuid": "f9d6d02c-2c21-40e8-b8f7-c11ad8975bb4",
                "control-id": "OPS.1.2.5.A6",
                "description": "AI-Begründung: Eine formale Richtlinie fasst alle Regelungen zur Fernwartung im TGM zusammen und stellt sicher, dass diese allen Beteiligten bekannt und verbindlich sind."
              },
              {
                "uuid": "4bf0d846-4daf-4cd8-b27c-eb8ec82f82ed",
                "control-id": "ORP.2.A1",
                "description": "AI-Begründung: Eine geregelte Einarbeitung stellt sicher, dass neue Mitarbeitende im TGM ihre sicherheitsrelevanten Aufgaben und Pflichten von Anfang an kennen und befolgen."
              },
              {
                "uuid": "12dd497f-1e4a-419d-8314-ad24f3d74855",
                "control-id": "ORP.2.A2",
                "description": "AI-Begründung: Ein geregelter Offboarding-Prozess ist im TGM kritisch, um sicherzustellen, dass ausscheidende Mitarbeitende keinen Zugriff mehr auf Gebäude- und Steuerungssysteme haben."
              },
              {
                "uuid": "4ae3bedd-4e7f-43d3-9cec-da541bb0d0c8",
                "control-id": "ORP.2.A3",
                "description": "AI-Begründung: Vertretungsregelungen sind für den kontinuierlichen und sicheren Betrieb von TGM-Anlagen essenziell, um bei Ausfällen von Personal handlungsfähig zu bleiben."
              },
              {
                "uuid": "38c39ecb-9e0c-4bda-8b03-e200e76ca4a7",
                "control-id": "ORP.2.A4",
                "description": "AI-Begründung: Da im TGM häufig Fremdpersonal (Wartung, Bau) eingesetzt wird, ist die Regelung von dessen Einsatz zur Einhaltung der Sicherheitsvorgaben unerlässlich."
              },
              {
                "uuid": "e28b515b-19f5-4856-b353-d5f243c7b267",
                "control-id": "ORP.2.A5",
                "description": "AI-Begründung: Vertraulichkeitsvereinbarungen schützen sensible TGM-Informationen (z. B. technische Pläne, Schwachstellen) bei der Weitergabe an externe Dienstleister."
              },
              {
                "uuid": "9e6348ab-f279-42f6-86c0-6746e8d5d48a",
                "control-id": "ORP.2.A14",
                "description": "AI-Begründung: Die klare Dokumentation von Aufgaben und Zuständigkeiten im TGM ist eine Grundvoraussetzung, um Informationssicherheit effektiv umsetzen und Verantwortlichkeiten zuweisen zu können."
              },
              {
                "uuid": "7e820702-0614-45f5-ba18-fe1c00780d1e",
                "control-id": "ORP.2.A7",
                "description": "AI-Begründung: Für sicherheitskritische Rollen im TGM (z. B. Administration von Leittechnik) ist die Überprüfung der Vertrauenswürdigkeit eine wichtige Maßnahme gegen Insider-Risiken."
              },
              {
                "uuid": "5b7cdccc-05e5-447b-b1c0-d15cac9c7cce",
                "control-id": "ORP.2.A13",
                "description": "AI-Begründung: Diese Anforderung ist relevant für TGM in Hochsicherheitsbereichen oder kritischen Infrastrukturen, wo eine erweiterte Überprüfung des Personals notwendig ist."
              },
              {
                "uuid": "bb1a21db-e79a-41f9-bd6c-74c26dafa583",
                "control-id": "ORP.4.A1",
                "description": "AI-Begründung: Ein geregelter Lebenszyklus für Benutzerkonten ist fundamental, um den Zugriff auf kritische TGM-Systeme zu kontrollieren und verwaiste Konten zu vermeiden."
              },
              {
                "uuid": "f0e727b2-7192-4e19-85a4-9bb753953141",
                "control-id": "ORP.4.A3",
                "description": "AI-Begründung: Eine aktuelle Dokumentation der Berechtigungen ist für Audits und die regelmäßige Überprüfung der Zugriffskontrolle in TGM-Systemen unerlässlich."
              },
              {
                "uuid": "f2967d13-1fa1-40f9-b05c-af0fd2e34bbd",
                "control-id": "ORP.4.A4",
                "description": "AI-Begründung: Die Funktionstrennung, z. B. zwischen der Administration von TGM-Anwendungen und der Verwaltung von Benutzerkonten, erhöht die Sicherheit und verhindert Missbrauch."
              },
              {
                "uuid": "e2ee3583-93ef-4b59-99fb-ad7a208a5c97",
                "control-id": "ORP.4.A5",
                "description": "AI-Begründung: Der Prozess zur Vergabe von Zutrittsberechtigungen zu TGM-Technikräumen ist ein integraler Bestandteil des Managements und muss sicher gestaltet sein."
              },
              {
                "uuid": "3c6ebbdd-bf8e-4c81-bb91-b193468874b0",
                "control-id": "ORP.4.A6",
                "description": "AI-Begründung: Die Vergabe von logischen Zugangsberechtigungen (z.B. VPN) ist direkt relevant für die Absicherung der Fernwartung von TGM-Anlagen."
              },
              {
                "uuid": "9918242b-c79e-465c-a8c3-f3ccb26af607",
                "control-id": "ORP.4.A7",
                "description": "AI-Begründung: Die Steuerung der Zugriffsrechte auf TGM-Anwendungen und -Daten ist der Kern der Zugriffskontrolle und schützt vor unberechtigten Manipulationen."
              },
              {
                "uuid": "49a07c32-4399-4a39-910b-01dd2a9176af",
                "control-id": "ORP.4.A8",
                "description": "AI-Begründung: Eine verbindliche Passwortregelung ist eine grundlegende Sicherheitsmaßnahme für alle TGM-Systeme, die eine passwortbasierte Authentisierung verwenden."
              },
              {
                "uuid": "caf52959-26aa-419e-9e35-ddb7b06940a7",
                "control-id": "ORP.4.A10",
                "description": "AI-Begründung: Administratorenkonten für TGM-Systeme gewähren weitreichenden Zugriff und müssen daher besonders durch Mehr-Faktor-Authentisierung geschützt werden."
              },
              {
                "uuid": "a5c7dddb-7ace-45b5-a78d-da3e48d84e2c",
                "control-id": "ORP.4.A11",
                "description": "AI-Begründung: Ein definierter, sicherer Prozess zum Zurücksetzen von Passwörtern ist ein wichtiger operativer Baustein des Identitätsmanagements für TGM-Benutzer."
              },
              {
                "uuid": "212e9615-7ecd-40d9-9cda-4b5428bf5c86",
                "control-id": "ORP.4.A12",
                "description": "AI-Begründung: Ein Authentisierungskonzept definiert die Sicherheitsanforderungen für TGM-Systeme und stellt eine durchdachte und konsistente Umsetzung der Authentisierung sicher."
              },
              {
                "uuid": "3d404a8b-8b4f-48c0-9f9e-5e3ac93e48a2",
                "control-id": "ORP.4.A20",
                "description": "AI-Begründung: Ein Ausfall des IAM-Systems könnte den Betrieb des TGM lahmlegen. Eine entsprechende Notfallvorsorge ist daher für kritische Gebäude unerlässlich."
              },
              {
                "uuid": "2953dd05-7f4b-445f-83c8-7e03a7a41fae",
                "control-id": "ORP.4.A21",
                "description": "AI-Begründung: Für TGM-Systeme mit hohem Schutzbedarf ist eine durchgängige Mehr-Faktor-Authentisierung ein wirksames Mittel, um die Zugriffssicherheit zu erhöhen."
              },
              {
                "uuid": "6393fd02-4c4b-40da-9718-02bc0bc25237",
                "control-id": "ORP.4.A24",
                "description": "AI-Begründung: Für besonders kritische administrative Tätigkeiten an TGM-Anlagen kann das Vier-Augen-Prinzip das Risiko von Fehlern oder Missbrauch deutlich reduzieren."
              }
            ]
          },
          {
            "uuid": "11f65e8f-7761-4e69-9396-a9d780741a7d",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "SYS.0 Allgemeine Kontrollen",
            "implemented-requirements": [
              {
                "uuid": "b80230d7-85a3-479e-b1ca-549a734a6641",
                "control-id": "ORP.2.A15",
                "description": "AI-Begründung: Die Systeme im TGM werden komplexer. Daher ist die adäquate Qualifikation des Personals entscheidend für den sicheren Betrieb."
              },
              {
                "uuid": "cb6e0223-98ec-42c1-957b-9fa1ec54323b",
                "control-id": "ORP.4.A2",
                "description": "AI-Begründung: Die Vergabe von Berechtigungen nach dem Need-to-know-Prinzip ist für TGM-Systeme entscheidend, um das Risiko durch Fehlbedienung oder Kompromittierung zu minimieren."
              },
              {
                "uuid": "64cd6379-f2d4-4283-be31-7f46798abbf5",
                "control-id": "ORP.4.A9",
                "description": "AI-Begründung: Jeder Zugriff auf TGM-Systeme muss über eine sichere Identifikation und Authentisierung erfolgen, um unautorisierten Zugang zu verhindern."
              },
              {
                "uuid": "828c066c-6787-418b-8150-43d2e16c51e9",
                "control-id": "ORP.4.A13",
                "description": "AI-Begründung: Die Auswahl schutzbedarfsadäquater Authentisierungsmechanismen stellt sicher, dass der Schutz der TGM-Systeme dem Risiko angemessen ist."
              },
              {
                "uuid": "763b4347-7911-412b-97fa-eb6d23fbfd74",
                "control-id": "ORP.1.A4",
                "description": "AI-Begründung: Die Trennung von unvereinbaren Aufgaben, z. B. Planung und Abnahme von TGA-Komponenten, ist ein wichtiges organisatorisches Kontrollprinzip zur Risikominimierung."
              },
              {
                "uuid": "68d37724-5ade-4424-bab8-a0db46080cc2",
                "control-id": "CON.1.A1",
                "description": "AI-Begründung: Da TGM-Systeme zunehmend vernetzt sind und sensible Daten verarbeiten, ist der Einsatz starker und anerkannter Kryptografieverfahren für die Absicherung der Kommunikation unerlässlich."
              },
              {
                "uuid": "519e21df-8499-4d54-ac98-b90e4c78d202",
                "control-id": "CON.1.A4",
                "description": "AI-Begründung: Der Einsatz von Kryptografie im TGM erfordert ein durchdachtes Schlüsselmanagement, um die Sicherheit von Zertifikaten und Schlüsseln über deren gesamten Lebenszyklus zu gewährleisten."
              },
              {
                "uuid": "3b3ec098-9dc2-450d-b795-8ffa738c9a43",
                "control-id": "CON.3.A5",
                "description": "AI-Begründung: Konfigurations- und Historiendaten von TGM-Systemen sind für den Betrieb und die Wiederherstellung im Notfall kritisch und müssen daher regelmäßig gesichert werden."
              },
              {
                "uuid": "40089032-f119-4412-8d51-e7bf111d7483",
                "control-id": "OPS.1.1.2.A5",
                "description": "AI-Begründung: Die Nachweisbarkeit administrativer Änderungen an TGM-Systemen ist für die Fehlersuche, die Forensik und die Zuweisung von Verantwortung von entscheidender Bedeutung."
              },
              {
                "uuid": "cbbfcd98-4e72-4a2f-a5da-d1c58aa6fe89",
                "control-id": "OPS.1.1.2.A6",
                "description": "AI-Begründung: Administrative Schnittstellen von TGM-Komponenten sind privilegierte Zugänge und müssen besonders gegen unbefugte Nutzung geschützt werden."
              },
              {
                "uuid": "d9a01842-7dc9-431a-a0b7-34122e7fb6bc",
                "control-id": "OPS.1.1.3.A1",
                "description": "AI-Begründung: Ein geregeltes Patch- und Änderungsmanagement ist für die heterogene TGM-Systemlandschaft essenziell, um Sicherheitslücken zu schließen und die Stabilität des Betriebs zu wahren."
              },
              {
                "uuid": "63553e98-6485-4bae-aaaa-88fd1576a9a0",
                "control-id": "DER.1.A5",
                "description": "AI-Begründung: Die Aktivierung und Nutzung nativer Detektionsfunktionen von TGM-Komponenten ist eine grundlegende und pragmatische Maßnahme zur Erkennung von Sicherheitsvorfällen."
              },
              {
                "uuid": "fea3b4b8-0b0d-436d-beb8-aaf33fb919ab",
                "control-id": "DER.1.A9",
                "description": "AI-Begründung: Für vernetzte TGM-Umgebungen ist der Einsatz zusätzlicher Detektionssysteme (z. B. NIDS) wertvoll, um Angriffsversuche zu erkennen, die präventive Maßnahmen umgangen haben."
              }
            ]
          }
        ]
      }
    ]
  }
}