{
  "component-definition": {
    "uuid": "b129c3fd-2dcd-47ce-937e-7d4ebf4fb9b4",
    "metadata": {
      "title": "Component for Baustein NET.4.2: VoIP",
      "last-modified": "2025-06-26T11:39:28.267646+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.2",
      "remarks": "AI-enriched component for NET.4.2."
    },
    "components": [
      {
        "uuid": "f0471b86-0e84-42f4-91c7-8b93035acc9f",
        "type": "service",
        "title": "VoIP",
        "description": "Implementation of controls for Baustein NET.4.2.",
        "control-implementations": [
          {
            "uuid": "a025753c-1cc6-4fa4-b85a-4a4f7f99bfdf",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "Implementation for all controls in group NET.4.2: VoIP",
            "implemented-requirements": [
              {
                "uuid": "6988ada2-d31e-459e-8d67-a2d467ff06a1",
                "control-id": "NET.4.2.A1",
                "description": "Base implementation for control NET.4.2.A1."
              },
              {
                "uuid": "3ee0ffee-257a-4340-b1fe-9dcbdc9ce2e2",
                "control-id": "NET.4.2.A3",
                "description": "Base implementation for control NET.4.2.A3."
              },
              {
                "uuid": "20b77772-dbe0-4a99-80da-6fe430f1d7de",
                "control-id": "NET.4.2.A4",
                "description": "Base implementation for control NET.4.2.A4."
              },
              {
                "uuid": "c916728f-ccc2-4d35-861a-979ca49eee7c",
                "control-id": "NET.4.2.A5",
                "description": "Base implementation for control NET.4.2.A5."
              },
              {
                "uuid": "648a8b87-a061-436a-9e9e-9ee46613fd73",
                "control-id": "NET.4.2.A7",
                "description": "Base implementation for control NET.4.2.A7."
              },
              {
                "uuid": "5e6acd86-73dc-4560-babd-319de9ed5665",
                "control-id": "NET.4.2.A8",
                "description": "Base implementation for control NET.4.2.A8."
              },
              {
                "uuid": "9382f7d7-90ae-4406-adaf-18f1aa5552bd",
                "control-id": "NET.4.2.A9",
                "description": "Base implementation for control NET.4.2.A9."
              },
              {
                "uuid": "74091e08-11c3-4af1-b9e2-7d410e81e218",
                "control-id": "NET.4.2.A11",
                "description": "Base implementation for control NET.4.2.A11."
              },
              {
                "uuid": "51faea75-7a44-4c4f-83e7-acdce9d0eb19",
                "control-id": "NET.4.2.A12",
                "description": "Base implementation for control NET.4.2.A12."
              },
              {
                "uuid": "4b777e5e-7101-4db1-a754-a16cd2826187",
                "control-id": "NET.4.2.A13",
                "description": "Base implementation for control NET.4.2.A13."
              },
              {
                "uuid": "53a6381a-81e6-4040-ba6c-63d9328e016a",
                "control-id": "NET.4.2.A14",
                "description": "Base implementation for control NET.4.2.A14."
              },
              {
                "uuid": "4f3685ef-9a90-49ce-94a9-6f9c4c942279",
                "control-id": "NET.4.2.A15",
                "description": "Base implementation for control NET.4.2.A15."
              },
              {
                "uuid": "662659f3-3e16-440c-91ab-0424f4ee89e4",
                "control-id": "NET.4.2.A16",
                "description": "Base implementation for control NET.4.2.A16."
              }
            ]
          },
          {
            "uuid": "ca3c88cb-509f-4b8e-b357-dd389461129e",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "Abhängigkeiten von verwandten Bausteinen",
            "implemented-requirements": [
              {
                "uuid": "7027c7de-ff83-4c2d-8e15-ac6b232be6b6",
                "control-id": "NET.1.1.A1",
                "description": "AI-Begründung: Da VoIP vollständig auf Datennetzen basiert, ist eine Netz-Sicherheitsrichtlinie fundamental. Sie legt die grundlegenden Schutzmaßnahmen wie Segmentierung, erlaubte Protokolle und Verschlüsselungsanforderungen fest, die für den sicheren Betrieb von VoIP-Diensten unerlässlich sind."
              },
              {
                "uuid": "35ec66ef-7633-41ee-9378-3acbfdc7790f",
                "control-id": "NET.1.1.A2",
                "description": "AI-Begründung: Eine vollständige und aktuelle Netz-Dokumentation ist entscheidend, um die VoIP-Infrastruktur, ihre Komponenten und Datenflüsse zu verstehen und gezielt absichern zu können."
              },
              {
                "uuid": "61c32fa9-7488-420a-a5fa-c4b482bba015",
                "control-id": "NET.1.1.A3",
                "description": "AI-Begründung: Spezifische Anforderungen, z. B. bezüglich Dienstgüte (QoS), Bandbreite und Sicherheit für Signalisierungs- und Sprachdaten, müssen definiert werden, um die Netzarchitektur für VoIP passend zu gestalten."
              },
              {
                "uuid": "5865f395-14bd-423d-a8f4-0f86e83c7e16",
                "control-id": "NET.1.1.A4",
                "description": "AI-Begründung: Die Trennung des Netzes in Zonen (z.B. DMZ für SIP-Server, internes Netz für Endgeräte) ist ein Kernprinzip zur Absicherung von VoIP-Diensten gegen Angriffe aus nicht vertrauenswürdigen Netzen."
              },
              {
                "uuid": "4599b1db-4885-43ee-b9cc-918dda9b4b13",
                "control-id": "NET.1.1.A5",
                "description": "AI-Begründung: VoIP-Endgeräte (Clients) und VoIP-Server (z. B. TK-Anlage) müssen in getrennten Netzsegmenten platziert werden, um die Kommunikation zu kontrollieren und die Ausbreitung von Schadsoftware zu verhindern."
              },
              {
                "uuid": "6b6a921a-b601-4e05-b860-3c7638fc8acd",
                "control-id": "NET.1.1.A6",
                "description": "AI-Begründung: VoIP-Telefone sollten in einem eigenen Netzsegment (VLAN) platziert werden, getrennt von anderen Endgeräten wie PCs, um spezifische Sicherheits- und QoS-Richtlinien anwenden zu können."
              },
              {
                "uuid": "3bb40fd8-ac4d-4580-a78a-945df56b78f4",
                "control-id": "NET.1.1.A7",
                "description": "AI-Begründung: Sprach- und Signalisierungsdaten sind schützenswerte Informationen. Diese Anforderung stellt sicher, dass sie durch sichere Protokolle wie SIPS, SIP-TLS und SRTP vor Abhören und Manipulation geschützt werden."
              },
              {
                "uuid": "6f17211c-960a-4778-bd0a-2a964f3602ef",
                "control-id": "NET.1.1.A8",
                "description": "AI-Begründung: Da VoIP-Dienste häufig externe Anbindungen über das Internet nutzen (z.B. für SIP-Trunking oder Home-Office-Anwender), ist die grundlegende Absicherung des Internetzugangs über eine Firewall zwingend erforderlich."
              },
              {
                "uuid": "b3c22118-56f7-4dd7-85b0-11d3da2ce379",
                "control-id": "NET.1.1.A9",
                "description": "AI-Begründung: Netze von externen VoIP-Providern oder angebundenen Partnern müssen als nicht vertrauenswürdig eingestuft und entsprechend abgesichert werden, um die eigene Infrastruktur zu schützen."
              },
              {
                "uuid": "2815802d-a774-440d-8b07-d35c3b159316",
                "control-id": "NET.3.2.A1",
                "description": "AI-Begründung: Eine Firewall ist eine zentrale Schutzkomponente für VoIP. Eine dedizierte Richtlinie ist notwendig, um den sicheren Umgang mit VoIP-spezifischen Protokollen und Ports zu regeln."
              },
              {
                "uuid": "06e2094f-00ba-4b89-873b-610964e4ce47",
                "control-id": "NET.3.2.A2",
                "description": "AI-Begründung: Für VoIP müssen präzise Firewall-Regeln nach dem Allowlist-Prinzip definiert werden, die nur die zwingend benötigten Ports für Signalisierung (z.B. SIP) und Medien (RTP) freigeben."
              },
              {
                "uuid": "4f9360fc-54b4-43f0-b00b-9e021620f3fc",
                "control-id": "NET.3.2.A3",
                "description": "AI-Begründung: Die zustandsbehaftete Filterung ist für VoIP-Protokolle wie SIP (oft TCP) und RTP (UDP) essenziell, um eine korrekte und sichere Kommunikation zu gewährleisten."
              },
              {
                "uuid": "bd52176b-84e2-4208-88c4-29a3880f6fb6",
                "control-id": "NET.3.2.A4",
                "description": "AI-Begründung: Die Firewall, die die VoIP-Infrastruktur schützt, muss selbst gehärtet und sicher konfiguriert sein, um nicht zu einem Sicherheitsrisiko zu werden."
              },
              {
                "uuid": "233b3b9e-a1b2-4065-a800-73d249eea124",
                "control-id": "NET.3.2.A6",
                "description": "AI-Begründung: Der administrative Zugriff auf die Firewall, die den VoIP-Verkehr filtert, muss streng geschützt werden, um unbefugte Änderungen an den sicherheitsrelevanten Regeln zu verhindern."
              },
              {
                "uuid": "75e7111c-52bc-45fd-bc44-7781f9fdedf9",
                "control-id": "NET.3.2.A7",
                "description": "AI-Begründung: Im Falle einer Fehlkonfiguration der Firewall-Regeln, die den VoIP-Dienst blockiert, muss ein Notfallzugriff gewährleistet sein, um den Betrieb schnell wiederherstellen zu können."
              },
              {
                "uuid": "caa0f79e-1b59-41f3-a029-75f2f3881ec6",
                "control-id": "NET.3.2.A9",
                "description": "AI-Begründung: Die Protokollierung von abgewiesenen Verbindungsversuchen auf der Firewall ist entscheidend, um Angriffe auf VoIP-Dienste (z.B. SIP-Scanning) zu erkennen und Verbindungsprobleme zu analysieren."
              },
              {
                "uuid": "444ddd3c-99dd-4255-919d-34d0256f2a97",
                "control-id": "NET.3.2.A10",
                "description": "AI-Begründung: VoIP-Komponenten sind wie alle IP-basierten Systeme anfällig für Fragmentierungsangriffe. Die Firewall muss diese Angriffsart abwehren können, um die Verfügbarkeit zu sichern."
              },
              {
                "uuid": "92214b47-8d84-4ec2-a7de-290955b2d5c5",
                "control-id": "NET.3.2.A14",
                "description": "AI-Begründung: Änderungen an Firewall-Regeln, die VoIP-Dienste betreffen, müssen nachvollziehbar dokumentiert werden, um einen sicheren und stabilen Betrieb zu gewährleisten."
              },
              {
                "uuid": "3f6fde5b-5ad5-49a5-8166-ad24a64af529",
                "control-id": "NET.3.2.A16",
                "description": "AI-Begründung: Der Einsatz eines Application-Level-Gateways (entspricht funktional oft einem Session Border Controller, SBC) ist eine Best-Practice-Architektur, um VoIP-Protokolle tiefgehend zu analysieren und abzusichern."
              },
              {
                "uuid": "999cd8f4-2f3c-4685-b884-e10ff4fbb13a",
                "control-id": "NET.3.2.A18",
                "description": "AI-Begründung: Die Administration der Firewall über ein separates Managementnetz erhöht die Sicherheit maßgeblich, da administrative Zugriffe vom produktiven VoIP-Datenverkehr getrennt werden."
              },
              {
                "uuid": "8231661f-88fd-4e52-9ab6-ebe6c2285c56",
                "control-id": "NET.3.2.A19",
                "description": "AI-Begründung: Diese Anforderung ist hochrelevant für VoIP, da sie direkt vor Denial-of-Service-Angriffen schützt, denen SIP (via TCP SYN Flooding) und RTP (via UDP Paket Storm) ausgesetzt sind."
              },
              {
                "uuid": "0e166c58-777c-484a-8c35-e2cc2517c84d",
                "control-id": "NET.3.2.A21",
                "description": "AI-Begründung: Zur Erkennung von Angriffen in verschlüsseltem VoIP-Verkehr (SIPS/SRTP) kann eine temporäre Entschlüsselung durch eine spezialisierte Komponente (z. B. Session Border Controller) sinnvoll sein."
              },
              {
                "uuid": "3abcdf1f-56e4-4e90-bb4d-5121bde8a776",
                "control-id": "NET.3.2.A22",
                "description": "AI-Begründung: Eine korrekte Systemzeit auf der Firewall ist für die Korrelation von Log-Ereignissen unerlässlich, was bei der Analyse von VoIP-sicherheitsrelevanten Vorfällen oder Störungen hilft."
              },
              {
                "uuid": "0f145ede-c26f-404b-b15f-86c76ab63a4c",
                "control-id": "NET.3.2.A23",
                "description": "AI-Begründung: Die Überwachung der Firewall-Auslastung und -Funktionalität ist wichtig, um die Verfügbarkeit der VoIP-Dienste, die von der Firewall-Konnektivität abhängen, sicherzustellen."
              },
              {
                "uuid": "5dcaa4ab-f1fe-4419-bff7-89823b3f9f8e",
                "control-id": "NET.3.2.A24",
                "description": "AI-Begründung: Regelmäßige Tests der Firewall-Konfiguration, idealerweise mit VoIP-spezifischen Angriffsszenarien, sind notwendig, um die Wirksamkeit der Schutzmaßnahmen zu überprüfen."
              },
              {
                "uuid": "f84de8e7-b39d-46f2-9b54-9e7d46b05fe1",
                "control-id": "NET.3.2.A32",
                "description": "AI-Begründung: Ein Ausfall der Firewall führt direkt zum Ausfall der VoIP-Telefonie. Daher ist eine spezifische Notfallvorsorge für die Firewall-Komponenten unerlässlich."
              }
            ]
          },
          {
            "uuid": "b78d3367-dbcf-4945-83fc-05b648cb3e29",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "SYS.0 Allgemeine Kontrollen",
            "implemented-requirements": [
              {
                "uuid": "0d10254f-224f-44f9-adf0-6741599ca6a0",
                "control-id": "ORP.1.A4",
                "description": "AI-Begründung: Funktionstrennung ist auch bei VoIP wichtig, z.B. zwischen der Administration der TK-Anlage (operativ) und der Überprüfung der Sicherheitskonfiguration und Protokolldaten (kontrollierend)."
              },
              {
                "uuid": "a399ed2c-c390-4f30-bebb-6788a6eb9d0f",
                "control-id": "ORP.2.A15",
                "description": "AI-Begründung: Die sichere Konfiguration und der Betrieb von VoIP-Systemen erfordern spezifisches Fachwissen über Protokolle (SIP, RTP) und Sicherheitskomponenten (SBC). Qualifiziertes Personal ist daher eine Grundvoraussetzung."
              },
              {
                "uuid": "5d7d3d14-bffe-47b4-ac36-efc3c29b10b6",
                "control-id": "ORP.4.A2",
                "description": "AI-Begründung: Das Prinzip der geringsten Berechtigung muss sowohl für administrative Zugriffe auf die VoIP-Anlage als auch für Benutzerberechtigungen (z.B. wer darf Ferngespräche führen) angewendet werden."
              },
              {
                "uuid": "6a4aaf87-767d-40f2-96d6-7579d6212eeb",
                "control-id": "ORP.4.A9",
                "description": "AI-Begründung: Der Zugriff auf VoIP-Endgeräte, Benutzerkonten und administrative Schnittstellen muss durch eine angemessene Authentisierung geschützt werden. Standardpasswörter müssen zwingend geändert werden."
              },
              {
                "uuid": "19c5d0f2-0636-4429-855e-92c770242587",
                "control-id": "ORP.4.A13",
                "description": "AI-Begründung: Die Stärke der Authentisierungsmechanismen (z. B. Passwortkomplexität, 2FA für Admin-Zugang) muss dem Schutzbedarf der VoIP-Infrastruktur und der darüber geführten Kommunikation entsprechen."
              },
              {
                "uuid": "e6feae9f-7cbc-4f51-a767-2d25c8038be2",
                "control-id": "CON.1.A1",
                "description": "AI-Begründung: Beim Einsatz von Verschlüsselung für VoIP (SRTP, SIPS/TLS) müssen starke, anerkannte kryptografische Algorithmen und Schlüssellängen verwendet werden, um eine wirksame Absicherung zu erzielen."
              },
              {
                "uuid": "564637a1-530b-46aa-ba67-ae8e27d75177",
                "control-id": "CON.1.A4",
                "description": "AI-Begründung: Ein funktionierendes Schlüsselmanagement ist für verschlüsseltes VoIP essenziell, um die für SIPS/TLS benötigten Zertifikate und die für SRTP ausgetauschten Schlüssel sicher zu verwalten."
              },
              {
                "uuid": "39bf0871-71f6-4cb9-a1b4-22c8094344f8",
                "control-id": "CON.3.A5",
                "description": "AI-Begründung: Die Konfiguration der VoIP-Anlage, Benutzerdaten, Anrufjournale und Voicemails müssen regelmäßig gesichert werden, um die Wiederherstellbarkeit des Dienstes zu gewährleisten."
              },
              {
                "uuid": "b6eb9817-dde4-46ac-a121-326cca66a582",
                "control-id": "OPS.1.1.2.A5",
                "description": "AI-Begründung: Administrative Änderungen an der VoIP-Anlage (z.B. an Rufnummernplänen oder Benutzerberechtigungen) müssen protokolliert und einer Person zugeordnet werden können."
              },
              {
                "uuid": "69dff2ec-8579-484d-8469-66cf2ad790a6",
                "control-id": "OPS.1.1.2.A6",
                "description": "AI-Begründung: Die administrativen Schnittstellen der VoIP-Komponenten müssen abgesichert und der Zugriff darauf auf berechtigte Personen und über sichere Protokolle (z.B. HTTPS) beschränkt werden."
              },
              {
                "uuid": "95c22804-3c13-4011-9dd2-c771d2aa9268",
                "control-id": "OPS.1.1.3.A1",
                "description": "AI-Begründung: VoIP-Server und -Endgeräte basieren auf Software, die Schwachstellen aufweisen kann. Ein geregelter Patch- und Änderungsmanagementprozess ist für die Sicherheit unerlässlich."
              },
              {
                "uuid": "da7e540f-3e24-4a3d-988b-eda6758e5c06",
                "control-id": "DER.1.A5",
                "description": "AI-Begründung: VoIP-Systeme protokollieren oft sicherheitsrelevante Ereignisse wie fehlgeschlagene Anmeldeversuche. Diese bordeigenen Detektionsfunktionen müssen aktiviert und ausgewertet werden, um z.B. Betrugsversuche zu erkennen."
              },
              {
                "uuid": "006c4300-35d6-4ea2-88a1-15bf16b8b145",
                "control-id": "DER.1.A9",
                "description": "AI-Begründung: Zusätzliche Detektionssysteme (z.B. NIDS) im Voice-VLAN können helfen, spezifische Angriffe auf VoIP-Protokolle zu erkennen, die von Endgeräten oder Firewalls möglicherweise nicht bemerkt werden."
              }
            ]
          }
        ]
      }
    ]
  }
}