{
  "component-definition": {
    "uuid": "86fb2585-6b33-4fb4-9142-dd1999b339e6",
    "metadata": {
      "title": "Component for Baustein NET.3.3: VPN",
      "last-modified": "2025-06-26T11:33:54.053877+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.2",
      "remarks": "AI-enriched component for NET.3.3."
    },
    "components": [
      {
        "uuid": "12378245-a3ea-45f6-ba50-dc8816ef5480",
        "type": "service",
        "title": "VPN",
        "description": "Implementation of controls for Baustein NET.3.3.",
        "control-implementations": [
          {
            "uuid": "56404130-2ca9-4c4c-93ed-c247e1c40066",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "Implementation for all controls in group NET.3.3: VPN",
            "implemented-requirements": [
              {
                "uuid": "59b8988e-7c7e-4390-9047-7d5b129fbe12",
                "control-id": "NET.3.3.A1",
                "description": "Base implementation for control NET.3.3.A1."
              },
              {
                "uuid": "2be9aa5d-2c7a-4da3-b2c7-34325190f053",
                "control-id": "NET.3.3.A2",
                "description": "Base implementation for control NET.3.3.A2."
              },
              {
                "uuid": "e295d4fb-8049-4e47-9e35-2cadd974a88b",
                "control-id": "NET.3.3.A3",
                "description": "Base implementation for control NET.3.3.A3."
              },
              {
                "uuid": "806967f6-39e1-4c55-9a14-f615ad57c7ea",
                "control-id": "NET.3.3.A4",
                "description": "Base implementation for control NET.3.3.A4."
              },
              {
                "uuid": "2447748e-5427-4de0-b1a0-d768ce21180b",
                "control-id": "NET.3.3.A5",
                "description": "Base implementation for control NET.3.3.A5."
              },
              {
                "uuid": "5b6c1ac7-0114-4f0b-b6f4-d9f15994064c",
                "control-id": "NET.3.3.A6",
                "description": "Base implementation for control NET.3.3.A6."
              },
              {
                "uuid": "fc3fb532-7368-4c07-8fb6-b72c42a58404",
                "control-id": "NET.3.3.A7",
                "description": "Base implementation for control NET.3.3.A7."
              },
              {
                "uuid": "4b748fca-d9ed-43d1-a645-ceec3d787d2e",
                "control-id": "NET.3.3.A8",
                "description": "Base implementation for control NET.3.3.A8."
              },
              {
                "uuid": "8d8adfd9-b464-4657-93c4-e87aa68b9c62",
                "control-id": "NET.3.3.A9",
                "description": "Base implementation for control NET.3.3.A9."
              },
              {
                "uuid": "6f6ec5af-a648-4c61-a819-83af30e25e88",
                "control-id": "NET.3.3.A10",
                "description": "Base implementation for control NET.3.3.A10."
              },
              {
                "uuid": "e5ad079c-3a26-42f8-89e1-d2af81a08502",
                "control-id": "NET.3.3.A11",
                "description": "Base implementation for control NET.3.3.A11."
              },
              {
                "uuid": "be3d5eae-81d0-44f3-9851-f2d66c58507d",
                "control-id": "NET.3.3.A12",
                "description": "Base implementation for control NET.3.3.A12."
              },
              {
                "uuid": "7f24e7bb-cd75-4fea-8cfd-6c8f32091e0d",
                "control-id": "NET.3.3.A13",
                "description": "Base implementation for control NET.3.3.A13."
              }
            ]
          },
          {
            "uuid": "396bfec8-d639-41d2-816b-68035c329ecb",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "Abhängigkeiten von verwandten Bausteinen",
            "implemented-requirements": [
              {
                "uuid": "73dd1629-5feb-4cc1-bcba-31bb3dc83fa1",
                "control-id": "CON.1.A2",
                "description": "AI-Begründung: VPN-Systeme verwenden langlebige kryptografische Schlüssel (z. B. Zertifikate, PSKs), die sicher gespeichert und gesichert werden müssen, um unbefugten Zugriff zu verhindern und die Wiederherstellbarkeit des Dienstes zu gewährleisten."
              },
              {
                "uuid": "6c4ab62e-2aff-4d63-86fc-f3b2bc328f47",
                "control-id": "CON.1.A5",
                "description": "AI-Begründung: Veraltete oder kompromittierte kryptografische Schlüssel (z.B. von widerrufenen Zertifikaten oder ehemaligen Mitarbeitenden) müssen sicher entfernt werden, um deren Missbrauch zu verhindern und die Sicherheit des VPNs aufrechtzuerhalten."
              },
              {
                "uuid": "3c4432fd-cc76-4326-8c77-58b635ad3e5f",
                "control-id": "CON.1.A9",
                "description": "AI-Begründung: Die Auswahl einer VPN-Lösung (Hard- oder Software) muss auf definierten Kriterien basieren, die insbesondere die Stärke und Korrektheit der implementierten kryptografischen Funktionen bewerten, um eine sichere Basis zu schaffen."
              },
              {
                "uuid": "2e4b0d27-d252-49ca-b8fd-3e35438520df",
                "control-id": "CON.1.A15",
                "description": "AI-Begründung: Kryptografische Verfahren, die in VPNs eingesetzt werden, können im Laufe der Zeit schwach werden. Ein definierter Prozess zur Identifizierung und zum Austausch geschwächter Verfahren ist für die langfristige Sicherheit des VPN unerlässlich."
              },
              {
                "uuid": "b7d69c48-88e5-4194-8692-0f51f5d2e8f1",
                "control-id": "CON.1.A19",
                "description": "AI-Begründung: Um auf Schwachstellen reagieren zu können (siehe CON.1.A15), ist es notwendig, in einem Kataster zu dokumentieren, welche kryptografischen Verfahren, Parameter und Produkte konkret im VPN-System im Einsatz sind."
              },
              {
                "uuid": "6485c354-8eaf-41c0-a914-31993f7f9bde",
                "control-id": "CON.1.A11",
                "description": "AI-Begründung: Werden Hardware-VPN-Appliances oder HSMs zur Schlüsselspeicherung eingesetzt, muss vor dem produktiven Einsatz getestet werden, ob deren kryptografische Funktionen korrekt und performant arbeiten."
              },
              {
                "uuid": "aafce097-aa50-427a-9987-50805616e45b",
                "control-id": "CON.1.A16",
                "description": "AI-Begründung: Die VPN-Server oder -Appliances sind kritische Komponenten, die kryptografische Schlüssel speichern und verarbeiten. Ihr physischer Schutz ist zwingend erforderlich, um Diebstahl oder Manipulation zu verhindern."
              },
              {
                "uuid": "735ef704-a6ae-4a51-89af-53ebd2908c3a",
                "control-id": "CON.1.A18",
                "description": "AI-Begründung: Für den ausfallsicheren Betrieb eines VPN, das auf Hardware-Appliances oder Hardware-Token für die Authentisierung basiert, ist die Vorhaltung von Ersatzgeräten zur schnellen Wiederherstellung des Dienstes notwendig."
              },
              {
                "uuid": "1295d466-e394-4fee-9a63-1f9a2558ffab",
                "control-id": "CON.1.A20",
                "description": "AI-Begründung: Die Integrität der VPN-Software und -Konfiguration ist entscheidend für die Sicherheit. Mechanismen zur Manipulationserkennung (z.B. File Integrity Monitoring, Secure Boot) schützen vor unbemerkten, bösartigen Änderungen."
              },
              {
                "uuid": "c4af359a-a37b-43b8-af40-5dda38d246af",
                "control-id": "OPS.1.1.2.A2",
                "description": "AI-Begründung: Der VPN-Zugang ist ein kritischer Dienst. Es muss sichergestellt sein, dass die Administration des VPN-Systems auch bei Ausfall eines Administrators durch qualifizierte Vertreter aufrechterhalten werden kann."
              },
              {
                "uuid": "61f94b4c-4ca9-470c-81ca-082a21ccb86c",
                "control-id": "OPS.1.1.2.A4",
                "description": "AI-Begründung: Administrative Zugänge zum VPN-System stellen ein hohes Risiko dar. Verlässt ein Administrator die Organisation, müssen dessen Berechtigungen umgehend entzogen werden, um Missbrauch zu verhindern."
              },
              {
                "uuid": "3f540886-60c5-4add-b131-f2c86230b65b",
                "control-id": "OPS.1.1.2.A16",
                "description": "AI-Begründung: Die administrativen Schnittstellen des VPN-Gateways sollten niemals aus dem Internet erreichbar sein. Die Beschränkung des Zugriffs auf ein dediziertes Management-Netz ist eine essentielle Härtungsmaßnahme."
              },
              {
                "uuid": "2133840b-9fae-4438-984c-7763ebf896dd",
                "control-id": "OPS.1.1.2.A21",
                "description": "AI-Begründung: Durch die Definition von granularen Admin-Rollen für das VPN-System (z.B. für Benutzerverwaltung vs. Netzwerkkonfiguration) wird das Minimalprinzip umgesetzt und das Risiko durch kompromittierte Admin-Konten reduziert."
              },
              {
                "uuid": "0c526c86-eaa3-4c15-a1bb-94ef5ffdf90f",
                "control-id": "OPS.1.1.2.A22",
                "description": "AI-Begründung: Um die Kompromittierung von hochprivilegierten administrativen Zugängen zum VPN-System zu verhindern, müssen administrative Tätigkeiten von alltäglichen Aufgaben (z.B. E-Mail, Surfen) strikt getrennt werden."
              },
              {
                "uuid": "e607acac-fbec-46dd-b511-acaf645399a6",
                "control-id": "OPS.1.1.2.A26",
                "description": "AI-Begründung: Eine regelmäßige Sicherung der VPN-Konfiguration ist für die schnelle Wiederherstellung des Dienstes nach einem Ausfall oder einer Fehlkonfiguration unerlässlich."
              },
              {
                "uuid": "07a4d9f0-6dfd-4eca-a96e-c09c0ee19213",
                "control-id": "OPS.1.1.3.A10",
                "description": "AI-Begründung: Um zu verhindern, dass manipulierte Updates auf das VPN-System aufgespielt werden, muss die Integrität und Authentizität von Patches und Softwarepaketen vor der Installation geprüft werden, z.B. mittels Signaturen oder Prüfsummen."
              },
              {
                "uuid": "b7548562-3763-4527-a0a9-6599b59d8b54",
                "control-id": "OPS.1.1.3.A15",
                "description": "AI-Begründung: VPN-Systeme sind exponierte und kritische Komponenten, die häufig Sicherheitslücken aufweisen. Eine zeitnahe Bewertung und Installation von Sicherheitspatches ist zur Abwehr von Angriffen zwingend erforderlich."
              },
              {
                "uuid": "6e9b7663-f959-4f06-824a-e79eaaecfa6f",
                "control-id": "OPS.1.2.5.A1",
                "description": "AI-Begründung: Falls das VPN-System selbst (z. B. durch einen externen Dienstleister) ferngewartet wird, muss dieser hochprivilegierte Zugriff sorgfältig geplant und abgesichert werden, um die Kontrolle über die kritische Infrastruktur nicht zu verlieren."
              },
              {
                "uuid": "585ade23-9c71-4146-a310-5539eff592b2",
                "control-id": "OPS.1.2.5.A3",
                "description": "AI-Begründung: Ein Fernwartungszugang zum VPN-Gateway ist ein extrem sensibles Einfallstor. Die Kommunikationsverbindungen müssen auf das Nötigste beschränkt, verschlüsselt und nach Gebrauch sofort wieder getrennt werden."
              },
              {
                "uuid": "10bdc171-e4b5-4379-b773-8b24ed58d0db",
                "control-id": "ORP.4.A1",
                "description": "AI-Begründung: Der Lebenszyklus von VPN-Benutzerkennungen muss klar geregelt sein, um sicherzustellen, dass nur aktuell berechtigte Personen Zugriff auf das interne Netz haben und Kennungen von ehemaligen Mitarbeitenden zeitnah gelöscht werden."
              },
              {
                "uuid": "571c8ae3-43a2-4d69-ad0f-b22337f7ab68",
                "control-id": "ORP.4.A6",
                "description": "AI-Begründung: Diese Anforderung definiert explizit die Notwendigkeit eines formalen Prozesses für die Vergabe und den Entzug von VPN-Zugangsberechtigungen, was eine Kerntätigkeit beim Betrieb eines VPNs darstellt."
              },
              {
                "uuid": "b8824d74-f502-4a26-860e-69535f88e238",
                "control-id": "ORP.4.A8",
                "description": "AI-Begründung: Wenn Passwörter Teil der VPN-Authentisierung sind, müssen klare und verbindliche Regeln für deren Komplexität und Handhabung existieren, da ein schwaches Passwort die Sicherheit der gesamten Verbindung untergräbt."
              },
              {
                "uuid": "c78b4939-a024-4d03-930a-bb0147d7f13d",
                "control-id": "ORP.4.A12",
                "description": "AI-Begründung: Für das VPN-System muss gezielt festgelegt werden, welche Authentisierungsverfahren (z.B. Zertifikate, MFA) mit welcher Stärke zum Einsatz kommen müssen, um den Schutzbedarf der dahinterliegenden Netze zu gewährleisten."
              },
              {
                "uuid": "e77ab918-733a-46dd-adf6-247308a4ffbd",
                "control-id": "ORP.4.A21",
                "description": "AI-Begründung: Der Zugang zum internen Netz über ein VPN ist ein kritischer Übergang. Der Einsatz von Mehr-Faktor-Authentisierung ist eine der wirksamsten Maßnahmen, um diesen Zugang gegen die Kompromittierung von Zugangsdaten abzusichern."
              },
              {
                "uuid": "09294cf2-3fa4-40c8-ade0-afaa0b373d8e",
                "control-id": "SYS.1.1.A1",
                "description": "AI-Begründung: Ein VPN-Server ist ein dediziertes Sicherheitssystem. Er muss physisch geschützt sein und darf nicht für andere Zwecke (z.B. als Arbeitsplatzrechner) missbraucht werden, um seine Kompromittierung zu vermeiden."
              },
              {
                "uuid": "8ecec2f2-61fd-42bb-9bf3-cc72f3b26258",
                "control-id": "SYS.1.1.A2",
                "description": "AI-Begründung: Der administrative Zugriff auf den VPN-Server selbst muss durch angemessene, idealerweise zentrale, Authentisierungsverfahren abgesichert werden, um eine sichere Verwaltung zu gewährleisten."
              },
              {
                "uuid": "22b031e8-ecbe-4414-92db-865f6acc34e0",
                "control-id": "SYS.1.1.A5",
                "description": "AI-Begründung: Um die lokale Angriffsfläche des VPN-Servers zu minimieren, müssen alle nicht benötigten physischen Schnittstellen (z.B. USB-Ports) deaktiviert werden."
              },
              {
                "uuid": "2181f230-97eb-4ba5-951b-b5c0615a6ed6",
                "control-id": "SYS.1.1.A6",
                "description": "AI-Begründung: Ein VPN-Server sollte als „Single-Purpose“-System betrieben werden. Alle nicht für den VPN-Betrieb notwendigen Dienste, Rollen und Softwarepakete müssen deaktiviert oder deinstalliert werden, um die Angriffsfläche zu minimieren."
              },
              {
                "uuid": "941fc14a-6c59-4548-a79c-ed833c7b5bf0",
                "control-id": "SYS.1.1.A10",
                "description": "AI-Begründung: Die lückenlose Protokollierung von sicherheitsrelevanten Ereignissen auf dem VPN-Server (z.B. Anmeldeversuche, Konfigurationsänderungen) ist die Grundlage für die Überwachung, Analyse und Aufklärung von Sicherheitsvorfällen."
              },
              {
                "uuid": "8be110fe-e2d7-420d-b5b5-674b6331bf57",
                "control-id": "SYS.1.1.A19",
                "description": "AI-Begründung: Ein lokaler Paketfilter (Host-Firewall) auf dem VPN-Server bietet eine zusätzliche Schutzschicht (Defense-in-Depth) und stellt sicher, dass nur die explizit erforderliche Kommunikation zum und vom Server erlaubt ist."
              },
              {
                "uuid": "b48f76d7-38a1-44aa-8c8a-6e4bcef0955d",
                "control-id": "SYS.1.1.A23",
                "description": "AI-Begründung: Der VPN-Dienst ist kritisch für die Erreichbarkeit von Ressourcen. Eine kontinuierliche Überwachung des Systemzustands und der Funktionsfähigkeit des VPN-Servers ist notwendig, um Ausfälle proaktiv zu erkennen und die Verfügbarkeit sicherzustellen."
              },
              {
                "uuid": "7e534b72-eb55-4163-b617-3ed4ba932928",
                "control-id": "SYS.1.1.A24",
                "description": "AI-Begründung: Da VPN-Server direkt aus dem Internet erreichbar sind, müssen sie regelmäßigen Sicherheitsprüfungen (z.B. Schwachstellenscans) unterzogen werden, um Konfigurationsfehler und Sicherheitslücken proaktiv zu identifizieren und zu beheben."
              },
              {
                "uuid": "09898faf-35e9-4e6c-848b-316b43b6bd1f",
                "control-id": "SYS.1.1.A34",
                "description": "AI-Begründung: Der VPN-Server speichert hochsensible Daten wie kryptografische Schlüssel und Konfigurationen. Die Verschlüsselung der Festplatten schützt diese Daten bei einem physischen Diebstahl des Geräts vor unbefugtem Zugriff."
              },
              {
                "uuid": "733bb5ec-eef2-4f29-a7d5-7b5d7b2b5447",
                "control-id": "SYS.1.1.A36",
                "description": "AI-Begründung: Die Absicherung des Bootvorgangs (z.B. mittels Secure Boot und BIOS-Passwort) verhindert, dass ein Angreifer mit physischem Zugriff ein alternatives Betriebssystem laden kann, um das VPN-System zu manipulieren oder Schlüssel zu extrahieren."
              },
              {
                "uuid": "720f2c1a-6eb7-4389-b164-44257e1f09b8",
                "control-id": "SYS.2.1.A6",
                "description": "AI-Begründung: Die Sicherheit der VPN-Verbindung ist wertlos, wenn der Client-Rechner, von dem sie ausgeht, kompromittiert ist. Ein aktueller und manipulationssicherer Schadsoftwareschutz auf dem Client ist daher unerlässlich."
              },
              {
                "uuid": "b7e6fcb3-2ff7-481a-bf16-e56cf59a20ed",
                "control-id": "SYS.2.1.A28",
                "description": "AI-Begründung: VPN-Clients sind häufig mobile Laptops, die ein hohes Diebstahlrisiko haben. Die Verschlüsselung der Festplatte schützt auf dem Client gespeicherte sensible Daten und potenziell auch zwischengespeicherte VPN-Zugangsdaten."
              },
              {
                "uuid": "2327ae79-92d1-4e47-b17f-8c24cb75cb67",
                "control-id": "SYS.2.1.A42",
                "description": "AI-Begründung: Unkontrollierte Cloud-Funktionen auf dem Client-Betriebssystem können den VPN-Tunnel umgehen und zu unbeabsichtigtem Datenabfluss führen. Ihre Nutzung muss daher auf das Notwendige beschränkt werden."
              }
            ]
          },
          {
            "uuid": "9d289b20-d36f-4e36-8069-60be61e59468",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "SYS.0 Allgemeine Kontrollen",
            "implemented-requirements": [
              {
                "uuid": "3dad25fd-03f3-4a62-80dc-92632670220e",
                "control-id": "CON.1.A1",
                "description": "AI-Begründung: VPNs basieren fundamental auf kryptografischen Verfahren. Die Auswahl sicherer und aktueller Algorithmen und Schlüssellängen ist entscheidend für die Vertraulichkeit und Integrität der VPN-Verbindung."
              },
              {
                "uuid": "92852557-e7a8-4858-9dda-2d01705dc15c",
                "control-id": "CON.1.A4",
                "description": "AI-Begründung: Ein VPN-System ist stark von einem sicheren Schlüsselmanagement abhängig, das den gesamten Lebenszyklus von Schlüsseln und Zertifikaten abdeckt, um die Authentizität der Kommunikationspartner und die Sicherheit der Verbindung zu garantieren."
              },
              {
                "uuid": "e3e8b2b1-24c0-45b0-80a9-b68533a376f0",
                "control-id": "OPS.1.1.2.A5",
                "description": "AI-Begründung: Änderungen an der VPN-Konfiguration können weitreichende Sicherheitsauswirkungen haben. Daher müssen alle administrativen Tätigkeiten protokolliert und nachvollziehbar sein, um unautorisierte Änderungen zu erkennen und die Verantwortlichkeit sicherzustellen."
              },
              {
                "uuid": "1baf6601-b265-42e3-ae52-7d3cfbde6069",
                "control-id": "OPS.1.1.2.A6",
                "description": "AI-Begründung: Die administrativen Schnittstellen des VPN-Systems sind ein primäres Angriffsziel. Ihr Schutz durch starke Authentisierung, Zugriffsbeschränkungen und verschlüsselte Protokolle ist für die Gesamtsicherheit des Systems fundamental."
              },
              {
                "uuid": "b70e7fa0-a8ec-47e8-bdf8-f4c613047197",
                "control-id": "ORP.4.A2",
                "description": "AI-Begründung: VPN-Benutzer sollten nur die Berechtigungen (z.B. Zugriff auf bestimmte Netzsegmente oder Anwendungen) erhalten, die sie für ihre Aufgaben benötigen (Minimalprinzip), um die Angriffsfläche bei einer Kompromittierung eines Endgeräts zu minimieren."
              },
              {
                "uuid": "11e75597-59f1-4bce-be2d-78546ff6e4d7",
                "control-id": "ORP.4.A9",
                "description": "AI-Begründung: Jede VPN-Verbindung muss auf einer sicheren und angemessenen Identifikation und Authentisierung des Benutzers oder Systems basieren. Dies ist die grundlegendste Sicherheitsfunktion eines VPNs."
              },
              {
                "uuid": "905eacc5-33b5-42fa-9439-e9a76d4465c2",
                "control-id": "ORP.4.A13",
                "description": "AI-Begründung: Zum Schutz vor Brute-Force-Angriffen auf den VPN-Zugang müssen Mechanismen wie die Begrenzung fehlgeschlagener Anmeldeversuche und die anschließende Sperrung von Kennungen implementiert werden."
              }
            ]
          }
        ]
      }
    ]
  }
}