{
  "component-definition": {
    "uuid": "49cc68aa-10b1-40d4-a602-c839984d71d6",
    "metadata": {
      "title": "Component for Baustein SYS.2.5: Client-Virtualisierung",
      "last-modified": "2025-06-26T10:57:31.766473+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.2",
      "remarks": "AI-enriched component for SYS.2.5."
    },
    "components": [
      {
        "uuid": "eeec37c5-8719-463d-afeb-9ca0ab017ddf",
        "type": "service",
        "title": "Client-Virtualisierung",
        "description": "Implementation of controls for Baustein SYS.2.5.",
        "control-implementations": [
          {
            "uuid": "5c44138b-0475-4243-9293-73e7c2c487da",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "Implementation for all controls in group SYS.2.5: Client-Virtualisierung",
            "implemented-requirements": [
              {
                "uuid": "a1ff51ed-1902-4f45-a18d-cb89734a8731",
                "control-id": "SYS.2.5.A1",
                "description": "Base implementation for control SYS.2.5.A1."
              },
              {
                "uuid": "9c00cb42-4bc2-4376-ba26-e99522fbbec4",
                "control-id": "SYS.2.5.A2",
                "description": "Base implementation for control SYS.2.5.A2."
              },
              {
                "uuid": "f3583dbd-89f5-455a-8ded-5ca061c33e75",
                "control-id": "SYS.2.5.A3",
                "description": "Base implementation for control SYS.2.5.A3."
              },
              {
                "uuid": "b0fd916c-d4e2-45ac-9c36-098a4d38bdf3",
                "control-id": "SYS.2.5.A4",
                "description": "Base implementation for control SYS.2.5.A4."
              },
              {
                "uuid": "3f467313-eae7-43a7-8d9c-b3b55d30e0b1",
                "control-id": "SYS.2.5.A5",
                "description": "Base implementation for control SYS.2.5.A5."
              }
            ]
          },
          {
            "uuid": "089366ba-50d9-4385-abf8-879a0aab2008",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "SYS.0 Allgemeine Kontrollen",
            "implemented-requirements": [
              {
                "uuid": "385ff22f-d271-4be7-a8f6-9e3ecbd08b4a",
                "control-id": "ORP.1.A4",
                "description": "AI-Begründung: In einer Client-Virtualisierungsumgebung gibt es unterschiedliche administrative Rollen (z.B. für die Virtualisierungsplattform, für die Client-Images), deren Trennung zur Vermeidung von Missbrauch und zur Risikominimierung unerlässlich ist."
              },
              {
                "uuid": "49cb8259-89e1-4f8a-9632-90dd2346e515",
                "control-id": "ORP.2.A15",
                "description": "AI-Begründung: Die Verwaltung einer zentralen Client-Virtualisierungsinfrastruktur erfordert spezifisches und aktuelles Fachwissen, um Fehlkonfigurationen und die daraus resultierenden Sicherheitsrisiken zu vermeiden."
              },
              {
                "uuid": "d63a5d7e-6e3e-49ed-93fa-775dfdf82d30",
                "control-id": "ORP.4.A2",
                "description": "AI-Begründung: Das Prinzip der geringsten Rechte ist fundamental, um den Zugriff auf die Virtualisierungs-Hosts, die Image-Templates und die einzelnen virtuellen Clients sicher zu steuern und den potenziellen Schaden bei einer Kompromittierung zu begrenzen."
              },
              {
                "uuid": "b13555f5-3f26-472f-a352-7c961aaa870b",
                "control-id": "ORP.4.A9",
                "description": "AI-Begründung: Eine sichere Authentisierung ist sowohl für Administratoren der Plattform als auch für die Benutzer, die auf ihre virtuellen Clients zugreifen, eine grundlegende und unverzichtbare Sicherheitsmaßnahme."
              },
              {
                "uuid": "75045a17-6195-406a-a77c-9c650118f578",
                "control-id": "ORP.4.A13",
                "description": "AI-Begründung: Aufgrund der Zentralität und Kritikalität der administrativen Zugänge sowie des Schutzes der Benutzersitzungen ist der Einsatz von dem Schutzbedarf angemessenen, starken Authentisierungsmechanismen erforderlich."
              },
              {
                "uuid": "16855b91-2686-499e-8ed1-9e0499a42c62",
                "control-id": "CON.1.A1",
                "description": "AI-Begründung: Die Verbindungen zwischen physischen und virtuellen Clients (z.B. per RDP/ICA) sowie die administrativen Zugriffe müssen kryptografisch abgesichert werden, um die Vertraulichkeit und Integrität der übertragenen Daten zu gewährleisten."
              },
              {
                "uuid": "5f7b5f7b-8db6-454b-a653-1ef1a9eb485f",
                "control-id": "CON.1.A4",
                "description": "AI-Begründung: Wenn Kryptografie für die Absicherung von Verbindungen eingesetzt wird, ist ein begleitendes, sicheres Schlüsselmanagement für die verwendeten Zertifikate und Schlüssel zwingend erforderlich, um die Schutzwirkung dauerhaft aufrechtzuerhalten."
              },
              {
                "uuid": "36d3d3f8-10e8-4665-89d5-2e90b71b8a46",
                "control-id": "CON.3.A5",
                "description": "AI-Begründung: Die regelmäßige Sicherung der virtuellen Client-Images, der Templates und der Konfiguration der Virtualisierungsinfrastruktur ist entscheidend, um die Verfügbarkeit und die Wiederherstellbarkeit nach Störungen oder Angriffen sicherzustellen."
              },
              {
                "uuid": "e8b0e7e0-3eb6-451f-abcb-843bc70b4bc3",
                "control-id": "OPS.1.1.2.A5",
                "description": "AI-Begründung: Administrative Tätigkeiten an der zentralen Virtualisierungsplattform sind kritisch. Ihre Nachweisbarkeit ist für Audits, die Fehlersuche und die forensische Analyse nach Sicherheitsvorfällen essenziell."
              },
              {
                "uuid": "c4db7dd2-07c2-4537-b1f8-d4b6ab70d997",
                "control-id": "OPS.1.1.2.A6",
                "description": "AI-Begründung: Der Schutz der administrativen Schnittstellen der Virtualisierungslösung ist von höchster Priorität, da deren Kompromittierung die Kontrolle über die gesamte virtualisierte Client-Umgebung ermöglichen würde."
              },
              {
                "uuid": "003b0798-d345-4365-b4eb-1287c67ae46f",
                "control-id": "OPS.1.1.3.A1",
                "description": "AI-Begründung: Ein geregeltes Patch- und Änderungsmanagement ist unerlässlich, um die Virtualisierungs-Hosts und insbesondere die zentralen Client-Templates aktuell und frei von bekannten Schwachstellen zu halten."
              },
              {
                "uuid": "f7c3a850-8962-4d02-a138-862a2de13a11",
                "control-id": "DER.1.A5",
                "description": "AI-Begründung: Die Aktivierung und Nutzung systemeigener Detektionsfunktionen auf den Virtualisierungs-Hosts und innerhalb der Gast-Betriebssysteme stellt eine grundlegende Fähigkeit zur Erkennung von Anomalien und Angriffen dar."
              },
              {
                "uuid": "803e081a-61b6-4917-9dfd-ee19ea7e180f",
                "control-id": "DER.1.A9",
                "description": "AI-Begründung: Zusätzliche netzwerkbasierte Detektionssysteme bieten wertvolle Einblicke in den Datenverkehr zur und von der Virtualisierungsinfrastruktur und können Angriffe aufdecken, die auf den Hosts selbst unentdeckt bleiben würden."
              }
            ]
          }
        ]
      }
    ]
  }
}