{
  "component-definition": {
    "uuid": "13870448-d58b-4e6a-bf25-cdbb24b2a85a",
    "metadata": {
      "title": "Component for Baustein SYS.3.2.4: Android",
      "last-modified": "2025-06-26T11:07:37.095088+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.2",
      "remarks": "AI-enriched component for SYS.3.2.4."
    },
    "components": [
      {
        "uuid": "20466c17-8472-40db-a6cf-6ecfe79f7f3c",
        "type": "service",
        "title": "Android",
        "description": "Implementation of controls for Baustein SYS.3.2.4.",
        "control-implementations": [
          {
            "uuid": "73439b32-5e79-4e24-9590-2fa238320d01",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "Implementation for all controls in group SYS.3.2.4: Android",
            "implemented-requirements": [
              {
                "uuid": "163a7c1a-37be-46de-b03c-ac3cfacb0163",
                "control-id": "SYS.3.2.4.A2",
                "description": "Base implementation for control SYS.3.2.4.A2."
              },
              {
                "uuid": "00d87c4a-5c69-4e4b-a978-1606028b4757",
                "control-id": "SYS.3.2.4.A3",
                "description": "Base implementation for control SYS.3.2.4.A3."
              },
              {
                "uuid": "d11a27ae-c33d-4d9c-a5f0-5e9ae93f06d6",
                "control-id": "SYS.3.2.4.A5",
                "description": "Base implementation for control SYS.3.2.4.A5."
              }
            ]
          },
          {
            "uuid": "7c8a64f2-562b-45eb-9f89-9b51a23892cc",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "Abhängigkeiten von verwandten Bausteinen",
            "implemented-requirements": [
              {
                "uuid": "5a462337-dee2-46c4-8490-df9018af694c",
                "control-id": "SYS.3.2.1.A1",
                "description": "AI-Begründung: Eine allgemeine Richtlinie ist die organisatorische Grundlage für die spezifischen Sicherheitsanforderungen an Android-Geräte und wird im Baustein-Kontext explizit als anzuwenden benannt."
              },
              {
                "uuid": "84de25bb-30a9-4d43-942a-6505f9540931",
                "control-id": "SYS.3.2.1.A2",
                "description": "AI-Begründung: Android-Geräte sind eng mit Cloud-Diensten (z.B. Google-Konto) verknüpft, daher ist eine Strategie für deren sichere Nutzung unerlässlich."
              },
              {
                "uuid": "d8c43a6e-66f9-47a1-9632-20c07ad08b0b",
                "control-id": "SYS.3.2.1.A3",
                "description": "AI-Begründung: Diese Anforderung ist fundamental, da jedes Android-Gerät eine sichere Basiskonfiguration als Ausgangspunkt für den Schutz von Daten und Systemen benötigt."
              },
              {
                "uuid": "83b7c1a8-1c24-412f-a1b8-8c9911688667",
                "control-id": "SYS.3.2.1.A4",
                "description": "AI-Begründung: Ein Gerätesperrcode und die automatische Bildschirmsperre sind grundlegende und unverzichtbare Schutzmaßnahmen für jedes mobile Endgerät, einschließlich Android."
              },
              {
                "uuid": "d819b0e9-3f3b-45e9-9333-c145a4abb164",
                "control-id": "SYS.3.2.1.A5",
                "description": "AI-Begründung: Die Update-Versorgung ist im Android-Ökosystem sehr heterogen. Diese Anforderung ist daher kritisch, um Sicherheitslücken zeitnah zu schließen."
              },
              {
                "uuid": "52bab93e-5233-44ad-8b45-d732daa3ec4f",
                "control-id": "SYS.3.2.1.A6",
                "description": "AI-Begründung: Das Android-Berechtigungsmodell ist ein zentraler Sicherheitsmechanismus. Die restriktive Konfiguration ist entscheidend für den Datenschutz und die Systemsicherheit."
              },
              {
                "uuid": "0aa1d1f4-2d8f-428c-a539-9cd49497dbc2",
                "control-id": "SYS.3.2.1.A7",
                "description": "AI-Begründung: Da mobile Geräte wie Android-Smartphones leicht verloren gehen können, ist ein klar definierter Meldeprozess für Sicherheitsvorfälle von hoher Bedeutung."
              },
              {
                "uuid": "72e55fed-f244-4c04-8db1-dbf9193d3581",
                "control-id": "SYS.3.2.1.A8",
                "description": "AI-Begründung: Die Regelung der App-Installation ist für Android besonders relevant, da Apps aus verschiedenen Quellen (Sideloading) installiert werden können, was ein erhebliches Risiko darstellt."
              },
              {
                "uuid": "0e7316ef-024b-4742-9f0f-c52c541c1c52",
                "control-id": "SYS.3.2.1.A9",
                "description": "AI-Begründung: Widgets und alternative Tastaturen sind verbreitete Funktionen unter Android. Ihre Nutzung sicher zu regeln, erhöht das Schutzniveau."
              },
              {
                "uuid": "aa8693aa-64d6-48a5-bcec-cad9cc6341fb",
                "control-id": "SYS.3.2.1.A10",
                "description": "AI-Begründung: Eine verbindliche Richtlinie für Mitarbeitende ist notwendig, um sicherheitsbewusstes Verhalten, wie z.B. das Verbot von Rooting, auf Android-Geräten durchzusetzen."
              },
              {
                "uuid": "ea70e77f-cd84-4eb1-84cc-09421f5c0994",
                "control-id": "SYS.3.2.1.A11",
                "description": "AI-Begründung: Die Verschlüsselung des Gerätespeichers ist ein kritischer Schutz bei Geräteverlust oder -diebstahl und eine Standardfunktion moderner Android-Versionen, deren Nutzung sichergestellt werden muss."
              },
              {
                "uuid": "97719c45-9ec3-4460-a17d-5753ad69e822",
                "control-id": "SYS.3.2.1.A12",
                "description": "AI-Begründung: Diese Anforderung stellt eine einfache, aber wirksame Maßnahme dar, um durch den Gerätenamen keine Rückschlüsse auf Institution oder Benutzer zuzulassen."
              },
              {
                "uuid": "d357067e-3b64-4f0a-a85f-ac83ec36f55c",
                "control-id": "SYS.3.2.1.A13",
                "description": "AI-Begründung: Android bietet native Funktionen zum Teilen von Bildschirminhalten (Casting). Die Regelung ihrer Nutzung ist relevant, um den Abfluss schützenswerter Informationen zu verhindern."
              },
              {
                "uuid": "f87f2e57-d01a-4318-bf26-1aa4ac9384b5",
                "control-id": "SYS.3.2.1.A16",
                "description": "AI-Begründung: Die bewusste Verwaltung von Schnittstellen wie Bluetooth und NFC ist eine grundlegende Sicherheitsmaßnahme, um Angriffsvektoren auf Android-Geräten zu minimieren."
              },
              {
                "uuid": "25ad1f23-7da9-40b6-b546-5c67a0497bfa",
                "control-id": "SYS.3.2.1.A18",
                "description": "AI-Begründung: Biometrische Verfahren sind auf Android-Geräten weit verbreitet. Diese Anforderung stellt sicher, dass ihre Nutzung einer Schutzbedarfsanalyse unterliegt."
              },
              {
                "uuid": "4813ded7-189c-4352-a1d3-009d2cf0885e",
                "control-id": "SYS.3.2.1.A19",
                "description": "AI-Begründung: Sprachassistenten wie der Google Assistant sind tief in Android integriert. Die Anforderung regelt deren Einsatz, um Sicherheits- und Datenschutzrisiken zu minimieren."
              },
              {
                "uuid": "2e5294bb-df08-486a-a25e-ebc697765f9e",
                "control-id": "SYS.3.2.1.A22",
                "description": "AI-Begründung: Die sichere Anbindung an die interne Infrastruktur mittels VPN ist eine Kernanforderung für den dienstlichen Einsatz von Android-Geräten."
              },
              {
                "uuid": "40a7dac6-2027-4e93-8d5f-7eede45bed6e",
                "control-id": "SYS.3.2.1.A28",
                "description": "AI-Begründung: Webseiten-Filterung ist eine relevante Sicherheitsmaßnahme, die auch auf den Browsern von Android-Geräten zum Schutz vor schädlichen Inhalten angewendet werden sollte."
              },
              {
                "uuid": "3d5323fa-f1a3-4246-bf7f-9a56aa96559a",
                "control-id": "SYS.3.2.1.A31",
                "description": "AI-Begründung: Mobile Payment (z.B. Google Pay) ist eine typische Funktion auf Android-Geräten. Es ist relevant zu regeln, ob und wie diese im dienstlichen Kontext genutzt werden darf."
              },
              {
                "uuid": "8441e1f3-953e-4dea-b353-1ff67c081f24",
                "control-id": "SYS.3.2.1.A32",
                "description": "AI-Begründung: Die Anforderung empfiehlt die Nutzung eines MDM, was die Grundlage für die zentrale Verwaltung und Absicherung von Android-Geräten ist."
              },
              {
                "uuid": "6a645da8-683b-4db8-a75f-587cd98eda3b",
                "control-id": "SYS.3.2.1.A33",
                "description": "AI-Begründung: Der Schutz vor Schadprogrammen mittels Sicherheits-Apps (Mobile Threat Defense) ist für das Android-Ökosystem eine wichtige zusätzliche Schutzschicht."
              },
              {
                "uuid": "d1301bdb-77b6-4a84-b362-ef2f669f4c14",
                "control-id": "SYS.3.2.1.A34",
                "description": "AI-Begründung: Android ermöglicht die Konfiguration von DNS-Servern (z.B. via 'Privates DNS'). Die Nutzung vertrauenswürdiger DNS-Server ist eine wertvolle Sicherheits- und Datenschutzmaßnahme."
              },
              {
                "uuid": "8f43728a-d26a-4116-9a7b-953570f99c26",
                "control-id": "SYS.3.2.1.A25",
                "description": "AI-Begründung: Diese Anforderung ist für Android hochrelevant, da 'Android Enterprise' dedizierte Arbeitsprofile zur Trennung von dienstlichen und privaten Daten bietet."
              },
              {
                "uuid": "fc74b740-9747-4470-8253-3107b18f9e8f",
                "control-id": "SYS.3.2.1.A30",
                "description": "AI-Begründung: Die Nutzung einer App-Allowlist ist eine wirksame Maßnahme zur Härtung von Android-Geräten, insbesondere in Umgebungen mit hohem Schutzbedarf."
              },
              {
                "uuid": "3dc49952-3ba3-495f-b961-c3a8f2eb5aa5",
                "control-id": "SYS.3.2.1.A35",
                "description": "AI-Begründung: Die bewusste Konfiguration der integrierten Firewall-Mechanismen von Android erhöht die Netzwerksicherheit des Geräts."
              },
              {
                "uuid": "65be76aa-5988-4940-913f-faf8d9cb0f5c",
                "control-id": "SYS.3.2.2.A4",
                "description": "AI-Begründung: Beschreibt den fundamentalen Prozess, wie eine sichere Konfiguration mittels MDM auf Android-Geräte ausgerollt wird, was für die Skalierbarkeit der Sicherheit entscheidend ist."
              },
              {
                "uuid": "29d92a48-077c-4192-9cc1-2b087d34ed7a",
                "control-id": "SYS.3.2.2.A5",
                "description": "AI-Begründung: Die Installation eines MDM-Clients ist der technische Grundstein, um ein Android-Gerät zentral verwalten und absichern zu können."
              },
              {
                "uuid": "825035c1-4dea-4c61-a6fb-33c6005adc50",
                "control-id": "SYS.3.2.2.A20",
                "description": "AI-Begründung: Diese Anforderung stellt sicher, dass die via MDM durchgesetzten Sicherheitseinstellungen für Android aktuell bleiben, insbesondere bei neuen Betriebssystem-Versionen."
              },
              {
                "uuid": "d3f9ecfd-966d-4f03-9400-6f0583af172d",
                "control-id": "SYS.3.2.2.A6",
                "description": "AI-Begründung: Die Protokollierung des Gerätestatus via MDM ermöglicht die Überwachung der Compliance und Konfiguration der Android-Geräteflotte."
              },
              {
                "uuid": "25761140-4bc3-46dc-90cf-0c715d8bcdfd",
                "control-id": "SYS.3.2.2.A7",
                "description": "AI-Begründung: Diese Anforderung konkretisiert die App-Verwaltung für den Fall eines MDM-Einsatzes, was eine zentrale Sicherheitsfunktion für verwaltete Android-Geräte darstellt."
              },
              {
                "uuid": "66069779-1ef2-4ea8-85b3-34f8c929d0dd",
                "control-id": "SYS.3.2.2.A21",
                "description": "AI-Begründung: Die zentrale Verwaltung von Zertifikaten via MDM ist für die sichere Anbindung von Android-Geräten an Unternehmensdienste (WLAN, VPN) unerlässlich."
              },
              {
                "uuid": "1a645e1d-b9bd-4a17-850a-b85597a3a6f0",
                "control-id": "SYS.3.2.2.A22",
                "description": "AI-Begründung: Die Fernlöschung (Remote Wipe) via MDM ist eine kritische Sicherheitsfunktion zum Schutz von Unternehmensdaten bei Verlust oder Diebstahl eines Android-Geräts."
              },
              {
                "uuid": "280321b6-9645-4694-aeb8-84d7fab1b751",
                "control-id": "SYS.3.2.2.A17",
                "description": "AI-Begründung: Das Erkennen von Manipulationen am Betriebssystem ('Rooten') ist eine spezifische und wichtige Sicherheitsfunktion von MDM-Lösungen für Android."
              },
              {
                "uuid": "2ecdb309-18f3-4042-aa54-c21d3ba8f59b",
                "control-id": "SYS.3.2.2.A23",
                "description": "AI-Begründung: Stellt die Kernfunktion eines MDM dar: die technische Durchsetzung von Sicherheitsrichtlinien und die Reaktion auf Verstöße auf dem Android-Gerät."
              }
            ]
          },
          {
            "uuid": "09855a7d-c339-4067-82d9-ec7fd806debc",
            "source": "gs://us_rag_storage_1/results/BSI_GS_OSCAL_current_2023_benutzerdefinierte.json",
            "description": "SYS.0 Allgemeine Kontrollen",
            "implemented-requirements": [
              {
                "uuid": "130a5fac-014c-4b17-b25a-a549b685974b",
                "control-id": "ORP.4.A2",
                "description": "AI-Begründung: Das Prinzip der geringsten Berechtigung ist fundamental und direkt auf Android anwendbar, sowohl für App-Berechtigungen auf dem Gerät als auch für den Zugriff auf Backend-Dienste."
              },
              {
                "uuid": "c4d59520-5276-4293-a9c0-be5f2dfc2be3",
                "control-id": "ORP.4.A9",
                "description": "AI-Begründung: Verstärkt die Notwendigkeit einer sicheren Authentisierung nicht nur am Gerät selbst, sondern auch für alle Dienste, auf die vom Android-Gerät aus zugegriffen wird."
              },
              {
                "uuid": "38d9f096-6b3c-4ec8-9a9d-27b3d8acc3f9",
                "control-id": "ORP.4.A13",
                "description": "AI-Begründung: Ergänzt die spezifischen Anforderungen an Zugriffsschutz, indem sie die schutzbedarfsabhängige Auswahl von Authentisierungsmechanismen (Passwort, Biometrie, MFA) für Android fordert."
              },
              {
                "uuid": "a1697b04-0ec7-404d-81cc-693b5c617855",
                "control-id": "CON.1.A1",
                "description": "AI-Begründung: Stellt sicher, dass die in Android und Apps genutzte Kryptografie (z.B. für Speicherverschlüsselung, TLS) aktuellen Sicherheitsstandards entspricht, was eine grundlegende Anforderung ist."
              },
              {
                "uuid": "b4e3145e-49c6-4528-a16f-9942bc45e03f",
                "control-id": "CON.1.A4",
                "description": "AI-Begründung: Ein adäquates Schlüsselmanagement ist die notwendige Ergänzung zur Kryptografie und relevant für Geräteschlüssel sowie Zertifikate auf Android-Geräten."
              },
              {
                "uuid": "5c86a213-d06c-40a6-8d68-cb0cd6be39f8",
                "control-id": "CON.3.A5",
                "description": "AI-Begründung: Adressiert den wichtigen, aber oft vernachlässigten Aspekt der Datensicherung für auf dem Android-Gerät gespeicherte dienstliche Informationen."
              },
              {
                "uuid": "2dba42b5-7d6c-4f04-85ac-d03080d0e6b4",
                "control-id": "OPS.1.1.2.A5",
                "description": "AI-Begründung: Gewährleistet die Nachvollziehbarkeit von Konfigurationsänderungen, die durch Administratoren via MDM auf Android-Geräten vorgenommen werden."
              },
              {
                "uuid": "8ab67e5d-770e-41cf-9f63-33c99797491e",
                "control-id": "OPS.1.1.2.A6",
                "description": "AI-Begründung: Sichert den administrativen Zugriff auf die Verwaltungsoberfläche (z.B. MDM-Konsole) ab, über die Android-Geräte konfiguriert werden."
              },
              {
                "uuid": "3f946117-a1ca-4f9b-baf3-9323181a84dc",
                "control-id": "OPS.1.1.3.A1",
                "description": "AI-Begründung: Formalisiert den Prozess für Betriebssystem- und App-Updates auf Android-Geräten und hebt die Wichtigkeit eines strukturierten Patch-Managements hervor."
              },
              {
                "uuid": "0caca0fd-9e01-4029-b274-dde0e826c3ea",
                "control-id": "DER.1.A5",
                "description": "AI-Begründung: Diese Anforderung ist hochrelevant, da sie die Nutzung von Android-eigenen Sicherheitsfunktionen wie 'Google Play Protect' zur Detektion von Bedrohungen vorschreibt."
              }
            ]
          }
        ]
      }
    ]
  }
}